#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-d04ae9/aws01/runs/run-dD9PcRE61MUDAiMu

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_lambda_function.test_lambda: Refreshing state... [id=tf_lambda]
aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
aws_api_gateway_rest_api.api: Refreshing state... [id=iyt897vqw4]
aws_api_gateway_api_key.api_key: Refreshing state... [id=dcbdwlmmig]
aws_api_gateway_model.model: Refreshing state... [id=d915rh]
aws_api_gateway_resource.resource: Refreshing state... [id=pvkc99]
aws_api_gateway_request_validator.validator: Refreshing state... [id=1mkvyt]
aws_wafv2_web_acl.waf: Refreshing state... [id=64ce0588-2228-4487-adc9-fdb5e53a1d38]
aws_api_gateway_method.method: Refreshing state... [id=agm-iyt897vqw4-pvkc99-POST]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-iyt897vqw4-pvkc99-POST]
aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-iyt897vqw4-pvkc99-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.deployment: Refreshing state... [id=eptmdy]
aws_api_gateway_stage.stage: Refreshing state... [id=ags-iyt897vqw4-test]
aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=41k7b2]
aws_api_gateway_method_settings.all: Refreshing state... [id=iyt897vqw4-test-*/*]
aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=dcbdwlmmig]
aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL/64ce0588-2228-4487-adc9-fdb5e53a1d38,arn:aws:apigateway:us-east-1::/restapis/iyt897vqw4/stages/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-iyt897vqw4-pvkc99-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
      - cache_cluster_size    = "0.5" -> null
        id                    = "ags-iyt897vqw4-test"
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.iam_for_lambda will be destroyed
  - resource "aws_iam_role" "iam_for_lambda" {
      - arn                   = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-09-30T08:26:06Z" -> null
      - force_detach_policies = false -> null
      - id                    = "tf_lambda_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "tf_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RV4WC7YQ7V" -> null

      - inline_policy {}
    }

  # aws_lambda_function.test_lambda will be destroyed
  - resource "aws_lambda_function" "test_lambda" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda" -> null
      - filename                       = "resources/lambda_function.zip" -> null
      - function_name                  = "tf_lambda" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "tf_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
      - last_modified                  = "2021-10-05T04:13:49.730+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "RR5p0KafVPz3FUjpLswCyMyN3eh37yAaBQvOS/jkSYA=" -> null
      - source_code_size               = 670 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CORS"     = "*"
              - "ENCODING" = "latin-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_wafv2_web_acl.waf will be destroyed
  - resource "aws_wafv2_web_acl" "waf" {
      - arn         = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL/64ce0588-2228-4487-adc9-fdb5e53a1d38" -> null
      - capacity    = 925 -> null
      - description = "Standard WebACL for API Gateway, TerraForm deploy." -> null
      - id          = "64ce0588-2228-4487-adc9-fdb5e53a1d38" -> null
      - lock_token  = "42f27b54-59a3-44e5-ac04-ae05eab30ac6" -> null
      - name        = "StandardACL" -> null
      - scope       = "REGIONAL" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - default_action {
          - allow {
            }
        }

      - rule {
          - name     = "AWSManagedRulesAmazonIpReputation" -> null
          - priority = 2 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputation" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRule" -> null
          - priority = 0 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesCommonRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRule" -> null
          - priority = 1 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }

      - visibility_config {
          - cloudwatch_metrics_enabled = false -> null
          - metric_name                = "StandardACL" -> null
          - sampled_requests_enabled   = false -> null
        }
    }

  # aws_wafv2_web_acl_association.waf_association must be replaced
-/+ resource "aws_wafv2_web_acl_association" "waf_association" {
      ~ id           = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL/64ce0588-2228-4487-adc9-fdb5e53a1d38,arn:aws:apigateway:us-east-1::/restapis/iyt897vqw4/stages/test" -> (known after apply)
      ~ web_acl_arn  = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL/64ce0588-2228-4487-adc9-fdb5e53a1d38" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.lambda.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "resources/lambda_function.zip"
      + function_name                  = "tf_lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "mKlugig7oBCpd8uj3hWmYt+f3XadAjFK8mCZsT8Ls/4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CORS"     = "*"
              + "ENCODING" = "latin-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.lambda.aws_wafv2_web_acl.waf_regional will be created
  + resource "aws_wafv2_web_acl" "waf_regional" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Standard WebACL for API Gateway, TerraForm deploy."
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "StandardACL_Regional"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWSManagedRulesAmazonIpReputation"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAmazonIpReputation"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRule"
          + priority = 0

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesCommonRule"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRule"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesKnownBadInputsRule"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "StandardACL"
          + sampled_requests_enabled   = false
        }
    }

  # module.waf.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.waf.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "resources/lambda_function.zip"
      + function_name                  = "tf_lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "mKlugig7oBCpd8uj3hWmYt+f3XadAjFK8mCZsT8Ls/4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CORS"     = "*"
              + "ENCODING" = "latin-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.waf.aws_wafv2_web_acl.waf_regional will be created
  + resource "aws_wafv2_web_acl" "waf_regional" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Standard WebACL for API Gateway, TerraForm deploy."
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "StandardACL_Regional"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWSManagedRulesAmazonIpReputation"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAmazonIpReputation"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRule"
          + priority = 0

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesCommonRule"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRule"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesKnownBadInputsRule"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "StandardACL"
          + sampled_requests_enabled   = false
        }
    }

Plan: 7 to add, 2 to change, 4 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "secret_access_key" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "access_key_id" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @fer1035, Action: `pull_request`*